app/Helpers/comidas_helper.php

function _comidas_nutrientes_activos(): array
{
    $m = new ComidasNutrientesModel();
    return $m->where('activo', 1)
             ->orderBy('es_macro','DESC')
             ->orderBy('orden','ASC')
             ->orderBy('nombre','ASC')
             ->findAll();
---
SELECT *
FROM `comidas_nutrientes`
WHERE `activo` = 1
ORDER BY `es_macro` DESC, `orden` ASC, `nombre` ASC

function comidas_limites(): array
{
    $db = Database::connect();

    $rows = $db->table('comidas_limites cl')
        ->select('cl.*, n.id AS n_id, n.nombre AS n_nombre, n.clave AS n_clave, n.unidad AS n_unidad')
        ->join('comidas_nutrientes n', 'n.id = cl.nutriente_id', 'inner')
        ->where('n.activo', 1)
        ->get()->getResultArray();
---
SELECT `cl`.*, `n`.`id` AS `n_id`, `n`.`nombre` AS `n_nombre`, `n`.`clave` AS `n_clave`, `n`.`unidad` AS `n_unidad`
FROM `comidas_limites` `cl`
INNER JOIN `comidas_nutrientes` `n` ON `n`.`id` = `cl`.`nutriente_id`
WHERE `n`.`activo` = 1