app/Controllers/Comidas/Alimentos.php

SELECT *
FROM `comidas_alimentos`
ORDER BY `nombre` ASC
 LIMIT 1000
SELECT COUNT(*) AS `numrows`
FROM `comidas_alimentos`
---
    public function index()
    {
        $q = trim((string) $this->request->getGet('q'));
        $m = new ComidasAlimentosModel();

        if ($q !== '') {
            $m->like('nombre', $q);
        }

        $rows  = $m->orderBy('nombre', 'ASC')->paginate(1000);