app/Controllers/Comidas/Alimentos.php

    public function edit($id)
    {
        helper('form'); // para form_open()

        $m   = new ComidasAlimentosModel();
        $row = $m->find($id);
---
SELECT *
FROM `comidas_alimentos`
WHERE `comidas_alimentos`.`id` = '109'