app/Controllers/Comidas/Diario.php

SELECT *
FROM `comidas_nutrientes`
WHERE `activo` = 1
ORDER BY `es_macro` DESC, `orden` ASC, `nombre` ASC
---
    private function getActiveNutrients(): array
    {
        // Todos los nutrientes activos, ordenados (macros primero)
        $nutM = new ComidasNutrientesModel();
        return $nutM->where('activo', 1)
            ->orderBy('es_macro', 'DESC')
            ->orderBy('orden', 'ASC')
            ->orderBy('nombre', 'ASC')
            ->findAll();