app/Controllers/Comidas/Recetas.php

SELECT *
FROM `comidas_recetas`
WHERE `comidas_recetas`.`id` = '2'
SELECT *
FROM `comidas_alimentos`
ORDER BY `nombre` ASC
 LIMIT 400
SELECT *
FROM `comidas_receta_ingredientes`
WHERE `receta_id` = '2'
SELECT *
FROM `comidas_alimentos`
WHERE `comidas_alimentos`.`id` = '56'
---
    public function edit($id)
    {
        $m    = new ComidasRecetasModel();
        $ingM = new ComidasRecetaIngredientesModel();
        $aliM = new ComidasAlimentosModel();

        $row = $m->find($id);
        if (!$row) {
            return redirect()->to(site_url('comidas/recetas'))
                   ->with('errors',['Receta no encontrada.']);
        }

        $alimentos = $aliM->orderBy('nombre','ASC')->findAll(400);

        $ingredientes = $ingM->where('receta_id',$id)->findAll();
        foreach ($ingredientes as &$ing) {
            $a = $aliM->find($ing['alimento_id']);