app/Controllers/Compras.php

    public function faltantes($supermercadoId)
    {
        $superModel = new CompraSupermercadoModel();
        $productoModel = new CompraProductoModel();
        $estadoModel = new CompraProductoModel();

        $supermercado = $superModel->find($supermercadoId);
        $productos = $productoModel
            ->where('supermercado_id', $supermercadoId)
            ->orderBy('nombre', 'ASC')
            ->findAll();


        foreach ($productos as &$producto) {
            $faltanteModel = new CompraFaltanteModel();
            $producto['faltante'] = $faltanteModel->where('producto_id', $producto['id'])->countAllResults() > 0;
---
SELECT *
FROM `compra_supermercados`
WHERE `compra_supermercados`.`id` = '2'
SELECT *
FROM `compra_productos`
WHERE `supermercado_id` = '2'
ORDER BY `nombre` ASC
SELECT COUNT(*) AS `numrows`
FROM `compra_faltantes`
WHERE `producto_id` = '5'

    public function limpiarFaltantes($supermercadoId)
    {
        $faltanteModel = new \App\Models\CompraFaltanteModel();
        $compradoModel = new \App\Models\CompraCompradoModel();
        $productoModel = new \App\Models\CompraProductoModel();

        // Obtener los productos de ese supermercado
        $productos = $productoModel->where('supermercado_id', $supermercadoId)->findAll();
---
SELECT *
FROM `compra_productos`
WHERE `supermercado_id` = '2'