app/Controllers/Dashboard.php

    public function index()
    {
        helper('recordatorio');

        $model = new LentillasSustitucionesModel();
        $ultima = $model->whereIn('elemento', ['lentilla izquierda', 'lentilla derecha', 'lentillas'])
                        ->orderBy('fecha', 'DESC')
                        ->first();
---
SELECT *
FROM `sustituciones`
WHERE `elemento` IN ('lentilla izquierda','lentilla derecha','lentillas')
ORDER BY `fecha` DESC
 LIMIT 1