app/Controllers/GimnasioEjercicios.php

    public function estadisticas($id)
    {
        $db = \Config\Database::connect();

        // Ejercicio
        $ejercicio = $db->table('gimnasio_ejercicios')->where('id', $id)->get()->getRowArray();
        if (!$ejercicio) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Ejercicio no encontrado');
        }

        // Resumen por fecha (fecha viene de entrenamientos)
        $seriesAgrupadas = $db->table('gimnasio_series s')
            ->select('en.fecha AS fecha, SUM(s.series) AS total_series, SUM(s.series * s.repeticiones) AS total_reps, COUNT(*) AS registros')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id')
            ->join('gimnasio_entrenamientos en', 'en.id = ee.entrenamiento_id')
            ->where('ee.ejercicio_id', $id)
            ->groupBy('en.fecha')
            ->orderBy('en.fecha', 'DESC')
            ->get()->getResultArray();

        // Detalle de series
        $seriesDetalle = $db->table('gimnasio_series s')
            ->select('en.fecha AS fecha, s.series, s.repeticiones, s.peso, s.rpe, s.nota')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id', 'inner')
            ->join('gimnasio_entrenamientos en', 'en.id = ee.entrenamiento_id', 'inner')
            ->where('ee.ejercicio_id', $id)
            ->orderBy('en.fecha', 'DESC')
            ->orderBy('s.id', 'ASC')
            ->get()->getResultArray();

        // Resumen por fecha (añadimos total_volumen)
        $seriesAgrupadas = $db->table('gimnasio_series s')
            ->select('en.fecha AS fecha,
              SUM(s.series) AS total_series,
              SUM(s.series * s.repeticiones) AS total_reps,
              SUM(s.series * s.repeticiones * s.peso) AS total_volumen,
              COUNT(*) AS registros')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id')
            ->join('gimnasio_entrenamientos en', 'en.id = ee.entrenamiento_id')
            ->where('ee.ejercicio_id', $id)
            ->groupBy('en.fecha')
            ->orderBy('en.fecha', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `gimnasio_ejercicios`
WHERE `id` = '11'
SELECT `en`.`fecha` AS `fecha`, SUM(s.series) AS total_series, SUM(s.series * s.repeticiones) AS total_reps, COUNT(*) AS registros
FROM `gimnasio_series` `s`
JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
JOIN `gimnasio_entrenamientos` `en` ON `en`.`id` = `ee`.`entrenamiento_id`
WHERE `ee`.`ejercicio_id` = '11'
GROUP BY `en`.`fecha`
ORDER BY `en`.`fecha` DESC
SELECT `en`.`fecha` AS `fecha`, `s`.`series`, `s`.`repeticiones`, `s`.`peso`, `s`.`rpe`, `s`.`nota`
FROM `gimnasio_series` `s`
INNER JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
INNER JOIN `gimnasio_entrenamientos` `en` ON `en`.`id` = `ee`.`entrenamiento_id`
WHERE `ee`.`ejercicio_id` = '11'
ORDER BY `en`.`fecha` DESC, `s`.`id` ASC
SELECT `en`.`fecha` AS `fecha`, SUM(s.series) AS total_series, SUM(s.series * s.repeticiones) AS total_reps, SUM(s.series * s.repeticiones * s.peso) AS total_volumen, COUNT(*) AS registros
FROM `gimnasio_series` `s`
JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
JOIN `gimnasio_entrenamientos` `en` ON `en`.`id` = `ee`.`entrenamiento_id`
WHERE `ee`.`ejercicio_id` = '11'
GROUP BY `en`.`fecha`
ORDER BY `en`.`fecha` DESC

    public function principales()
{
    $db = \Config\Database::connect();

    // Límite de registros (puedes cambiarlo desde la URL: ?limite=30)
    $limite = (int)($this->request->getGet('limite') ?? 20);

    // 1) Localizar IDs de los 3 ejercicios (tolerante con nombres comunes)
    $nombresBuscados = [
        'press banca'    => ['press banca', 'press de banca'],
        'peso muerto'    => ['peso muerto', 'deadlift'],
        'sentadillas'    => ['sentadilla', 'sentadillas', 'back squat', 'squat'],
    ];

    // Buscar por LIKE (case-insensitive)
    $ejercicios = [];
    foreach ($nombresBuscados as $clave => $patrones) {
        $builder = $db->table('gimnasio_ejercicios');
        $builder->groupStart();
        foreach ($patrones as $p) {
            $builder->orLike('LOWER(nombre)', mb_strtolower($p, 'UTF-8'));
        }
        $builder->groupEnd();
        $row = $builder->orderBy('id', 'ASC')->get()->getRowArray();
---
SELECT *
FROM `gimnasio_ejercicios`
WHERE   (
LOWER(nombre) LIKE '%sentadilla%' ESCAPE '!'
OR  LOWER(nombre) LIKE '%sentadillas%' ESCAPE '!'
OR  LOWER(nombre) LIKE '%back squat%' ESCAPE '!'
OR  LOWER(nombre) LIKE '%squat%' ESCAPE '!'
 )
ORDER BY `id` ASC

        $id = (int)$ej['id'];

        // Resumen limitado
        $resumen = $db->table('gimnasio_series s')
            ->select('en.fecha AS fecha,
                      SUM(s.series) AS total_series,
                      SUM(s.series * s.repeticiones) AS total_reps,
                      SUM(s.series * s.repeticiones * s.peso) AS total_volumen,
                      COUNT(*) AS registros')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id')
            ->join('gimnasio_entrenamientos en', 'en.id = ee.entrenamiento_id')
            ->where('ee.ejercicio_id', $id)
            ->groupBy('en.fecha')
            ->orderBy('en.fecha', 'DESC')
            ->limit($limite)
            ->get()->getResultArray();

        // Detalle limitado
        $detalle = $db->table('gimnasio_series s')
            ->select('en.fecha AS fecha, s.series, s.repeticiones, s.peso, s.rpe, s.nota')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id', 'inner')
            ->join('gimnasio_entrenamientos en', 'en.id = ee.entrenamiento_id', 'inner')
            ->where('ee.ejercicio_id', $id)
            ->orderBy('en.fecha', 'DESC')
            ->orderBy('s.id', 'ASC')
            ->limit($limite)
            ->get()->getResultArray();
---
SELECT `en`.`fecha` AS `fecha`, SUM(s.series) AS total_series, SUM(s.series * s.repeticiones) AS total_reps, SUM(s.series * s.repeticiones * s.peso) AS total_volumen, COUNT(*) AS registros
FROM `gimnasio_series` `s`
JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
JOIN `gimnasio_entrenamientos` `en` ON `en`.`id` = `ee`.`entrenamiento_id`
WHERE `ee`.`ejercicio_id` = 3
GROUP BY `en`.`fecha`
ORDER BY `en`.`fecha` DESC
 LIMIT 20
SELECT `en`.`fecha` AS `fecha`, `s`.`series`, `s`.`repeticiones`, `s`.`peso`, `s`.`rpe`, `s`.`nota`
FROM `gimnasio_series` `s`
INNER JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
INNER JOIN `gimnasio_entrenamientos` `en` ON `en`.`id` = `ee`.`entrenamiento_id`
WHERE `ee`.`ejercicio_id` = 3
ORDER BY `en`.`fecha` DESC, `s`.`id` ASC
 LIMIT 20