app/Controllers/GimnasioEntrenamientos.php

SELECT *
FROM `gimnasio_entrenamientos`
ORDER BY `fecha` DESC
---
    public function index()
    {
        $model = new GimnasioEntrenamientosModel();
        $entrenamientos = $model->orderBy('fecha', 'DESC')->findAll();

SELECT *
FROM `gimnasio_entrenamientos`
WHERE `id` = '2'
SELECT COUNT(*) AS registros, SUM(s.series) AS total_series, SUM(s.series * s.repeticiones) AS total_reps, SUM(s.series * s.repeticiones * s.peso) AS total_volumen
FROM `gimnasio_series` `s`
JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
WHERE `ee`.`entrenamiento_id` = '2'
SELECT `ge`.`id` AS `ejercicio_id`, `ge`.`nombre` AS `ejercicio`, `ee`.`orden` AS `orden_ejercicio`, SUM(s.series) AS sets, SUM(s.series * s.repeticiones) AS reps, SUM(s.series * s.repeticiones * s.peso) AS volumen_total
FROM `gimnasio_series` `s`
JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
JOIN `gimnasio_ejercicios` `ge` ON `ge`.`id` = `ee`.`ejercicio_id`
WHERE `ee`.`entrenamiento_id` = '2'
GROUP BY `ge`.`id`, `ge`.`nombre`, `ee`.`orden`
ORDER BY `ee`.`orden` ASC
SELECT `ge`.`id` AS `ejercicio_id`, `ge`.`nombre` AS `ejercicio`, `ee`.`orden` AS `orden_ejercicio`, `s`.`series`, `s`.`repeticiones`, `s`.`peso`, `s`.`rpe`, `s`.`nota`, `s`.`orden`
FROM `gimnasio_series` `s`
JOIN `gimnasio_entrenamiento_ejercicios` `ee` ON `ee`.`id` = `s`.`entrenamiento_ejercicio_id`
JOIN `gimnasio_ejercicios` `ge` ON `ge`.`id` = `ee`.`ejercicio_id`
WHERE `ee`.`entrenamiento_id` = '2'
ORDER BY `ee`.`orden` ASC, `s`.`orden` ASC, `s`.`id` ASC
---
    public function resumen($id)
    {
        $db = \Config\Database::connect();

        // 1) Datos generales del entrenamiento
        $entrenamiento = $db->table('gimnasio_entrenamientos')
            ->select('id, fecha, notas_generales, lesiones, sin_molestias')
            ->where('id', $id)
            ->get()->getRowArray();

        if (!$entrenamiento) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Entrenamiento no encontrado');
        }

        // Entrenamiento
        $ent = $db->table('gimnasio_entrenamientos')->where('id', $id)->get()->getRowArray();
        if (!$ent) {
            return $this->response->setStatusCode(404)->setBody('<div class="p-3">No existe el entrenamiento.</div>');
        }

        // Totales globales
        $global = $db->table('gimnasio_series s')
            ->select('COUNT(*) AS registros,
                  SUM(s.series) AS total_series,
                  SUM(s.series * s.repeticiones) AS total_reps,
                  SUM(s.series * s.repeticiones * s.peso) AS total_volumen')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id')
            ->where('ee.entrenamiento_id', $id)
            ->get()->getRowArray();

        // Resumen por ejercicio
        $porEjercicio = $db->table('gimnasio_series s')
            ->select('
        ge.id AS ejercicio_id,
        ge.nombre AS ejercicio,
        ee.orden AS orden_ejercicio,
        SUM(s.series) AS sets,
        SUM(s.series * s.repeticiones) AS reps,
        SUM(s.series * s.repeticiones * s.peso) AS volumen_total
    ')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id')
            ->join('gimnasio_ejercicios ge', 'ge.id = ee.ejercicio_id')
            ->where('ee.entrenamiento_id', $id)
            ->groupBy('ge.id, ge.nombre, ee.orden')
            ->orderBy('ee.orden', 'ASC')  // 👈 respetar orden del entreno
            ->get()->getResultArray();


        // Detalle de series por ejercicio (todas las series, ordenadas)
        $series = $db->table('gimnasio_series s')
            ->select('
        ge.id AS ejercicio_id,
        ge.nombre AS ejercicio,
        ee.orden AS orden_ejercicio,
        s.series, s.repeticiones, s.peso, s.rpe, s.nota, s.orden
    ')
            ->join('gimnasio_entrenamiento_ejercicios ee', 'ee.id = s.entrenamiento_ejercicio_id')
            ->join('gimnasio_ejercicios ge', 'ge.id = ee.ejercicio_id')
            ->where('ee.entrenamiento_id', $id)
            ->orderBy('ee.orden', 'ASC')  // 👈 primero orden de ejercicio
            ->orderBy('s.orden', 'ASC')   // luego orden de serie
            ->orderBy('s.id', 'ASC')
            ->get()->getResultArray();