app/Controllers/Lentillas.php

    public function index()
    {
        $avisoModel = new \App\Models\LentillasAvisosModel();
        $sustModel = new \App\Models\LentillasSustitucionesModel();
        $stockModel = new LentillasStockModel();

        // Buscar el aviso configurado para "lentillas"
        $aviso = $avisoModel->where('item', 'lentillas')->first();

        $stockItems = $stockModel->findAll();

        $dias = null;
        $mostrarAlerta = false;
        $ultimoCambio = null;

        if ($aviso) {
            // Buscar la última sustitución relacionada con lentillas
            $ultima = $sustModel
                ->whereIn('elemento', ['lentillas', 'lentilla izquierda', 'lentilla derecha'])
                ->orderBy('fecha', 'DESC')
                ->first();
---
SELECT *
FROM `sustituciones`
WHERE `elemento` IN ('lentillas','lentilla izquierda','lentilla derecha')
ORDER BY `fecha` DESC
 LIMIT 1