app/Controllers/Lentillas.php

SELECT *
FROM `datos_medicos`
 LIMIT 1
---
    public function index()
    {
        $datosModel = new \App\Models\DatosMedicosModel();
        $datos = $datosModel->first();