app/Controllers/Youtube.php

SELECT `youtube_listas`.*, COUNT(v.id) as total, SUM(v.visto=1) as vistos, SUM(v.relevante=1) as relevantes
FROM `youtube_listas`
LEFT JOIN `youtube_videos` `v` ON `v`.`lista_id` = `youtube_listas`.`id`
GROUP BY `youtube_listas`.`id`
---
    public function index()
    {
        $listas = $this->listas
            ->select('youtube_listas.*,
                  COUNT(v.id) as total,
                  SUM(v.visto=1) as vistos,
                  SUM(v.relevante=1) as relevantes')
            ->join('youtube_videos v', 'v.lista_id = youtube_listas.id', 'left')
            ->groupBy('youtube_listas.id')
            ->findAll();

SELECT COUNT(*) AS total,
            SUM(CASE WHEN visto = 1 THEN 1 ELSE 0 END)       AS vistos,
            SUM(CASE WHEN relevante = 1 THEN 1 ELSE 0 END)   AS relevantes
FROM `youtube_videos`
WHERE `lista_id` = '1'
---
    public function ver(string $slug)
    {
        $lista = $this->listas->findBySlug($slug);
        if (!$lista) {
            return redirect()->to(site_url('youtube'));
        }

        // Filtros y orden
        $filters = [
            'solo_no_vistos'  => (bool) $this->request->getGet('no_vistos'),
            'solo_relevantes' => (bool) $this->request->getGet('relevantes'),
        ];
        $sort = [
            'vistos'     => $this->request->getGet('sort_vistos'),      // no_vistos_primero | vistos_primero | null
            'relevantes' => $this->request->getGet('sort_relevantes'),  // primero | null
        ];

        // Listado: usa un CLONE del modelo para no compartir estado del builder
        $videosModel   = clone $this->videos;
        $data['videos'] = $videosModel->baseQuery($lista['id'], $filters, $sort)->findAll();

        // Estadísticas: conexión limpia con db_connect() (no $this->db)
        $db = db_connect();
        $stats = $db->table('youtube_videos')
            ->select("
            COUNT(*) AS total,
            SUM(CASE WHEN visto = 1 THEN 1 ELSE 0 END)       AS vistos,
            SUM(CASE WHEN relevante = 1 THEN 1 ELSE 0 END)   AS relevantes
        ", false)
            ->where('lista_id', $lista['id'])
            ->get()
            ->getRowArray();