app/Models/YoutubeListasModel.php

    public function findBySlug(string $slug)
    {
        return $this->where('slug',$slug)->first();
---
SELECT *
FROM `youtube_listas`
WHERE `slug` = 'videos'
 LIMIT 1